In [1]:
import pandas as pd

In [29]:
df = pd.read_csv(r'C:\Users\add\Documents\GitHub\Pandas_MasterClass\datasets\Life_expectancy_dataset.csv')

In [31]:
df.head()

   Rank       Country  Overall Life  Male Life  Female Life Continent
0     1        Monaco          89.5       85.6         93.5    Europe
1     2         Japan          85.0       81.7         88.5      Asia
2     3     Singapore          85.0       82.3         87.8      Asia
3     4  Macau; China          84.5       81.6         87.6      Asia
4     5    San Marino          83.3       80.7         86.1    Europe

In [32]:
df.shape

(223, 6)

In [34]:
df_melted = pd.melt(df, id_vars = 'Country', var_name = 'Overall Life', value_name = 'Rank')
df_melted

C:\Users\add\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3437: FutureWarning: This dataframe has a column name that matches the 'value_name' column name of the resulting Dataframe. In the future this will raise an error, please set the 'value_name' parameter of DataFrame.melt to a unique name.
  exec(code_obj, self.user_global_ns, self.user_ns)

            Country Overall Life    Rank
0            Monaco         Rank       1
1             Japan         Rank       2
2         Singapore         Rank       3
3      Macau; China         Rank       4
4        San Marino         Rank       5
...             ...          ...     ...
1110          Gabon    Continent  Africa
1111      Swaziland    Continent  Africa
1112    Afghanistan    Continent    Asia
1113  Guinea-Bissau    Continent  Africa
1114           Chad    Continent  Africa

[1115 rows x 3 columns]